# Pandas
S.127

Inhalt:
- test

## pandas-Datenstrukturen
values + index
- Series
- DataFrames

In [56]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

### Series

In [57]:
obj = pd.Series([4,7,-5,3])
obj
obj.values
obj.index

0    4
1    7
2   -5
3    3
dtype: int64

array([ 4,  7, -5,  3], dtype=int64)

RangeIndex(start=0, stop=4, step=1)

In [58]:
obj2 = pd.Series([2,5,-1,-8], index=['d','b','a','c'])
obj2
obj2.index

d    2
b    5
a   -1
c   -8
dtype: int64

Index(['d', 'b', 'a', 'c'], dtype='object')

In [59]:
np.exp(obj2)     # Zusammenhang mit Indizes bleibt erhalten!

obj2['b']        # Zugriff mittels Index

'b' in obj2

d      7.389056
b    148.413159
a      0.367879
c      0.000335
dtype: float64

5

True

**dict --> series**
- pd.Series()

In [60]:
# Series aus dict erstellen
sdata = {'Ohio':35000, 'Texas':71000,'Oregon':16000, 'Utah':5000}
sdata
obj3 = pd.Series(sdata)
obj3

# index selber Ã¼bergeben
print()
print('obj4:')
obj4 = pd.Series(sdata, index=['Califaronia', 'Utah', 'Ohio'])
obj4

# 
obj3 + obj4

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

obj4:

Califaronia        NaN
Utah            5000.0
Ohio           35000.0
dtype: float64

Califaronia        NaN
Ohio           70000.0
Oregon             NaN
Texas              NaN
Utah           10000.0
dtype: float64

**fehlende Daten finden**
- pd.isnull()

In [61]:
pd.isnull(obj4)

Califaronia     True
Utah           False
Ohio           False
dtype: bool

**Index & Name**

In [62]:
obj4.name = 'Population'
obj4.index.name = 'states'
obj4

states
Califaronia        NaN
Utah            5000.0
Ohio           35000.0
Name: Population, dtype: float64

### DataFrames
- Erstellen
- Spalten / Zeilen aufrufen
- Zuweisungen

**Erstellen**

In [63]:
data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
       'year':[2000,2001,2002,2000,2001,2002],
       'pop':['1.5','1,7','3.6','2.4','2.9','3.1']}
df1 = pd.DataFrame(data)
df1.head(2)

df2 = pd.DataFrame(data, columns=['pop','year','state'])
df2.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1,7

   pop  year state
0  1.5  2000  Ohio
1  1,7  2001  Ohio

In [64]:
df2 = pd.DataFrame(data, index=['a','b','c','d','e','f'], columns=['year','state','pop','dept'])
df2.head(2)

   year state  pop dept
a  2000  Ohio  1.5  NaN
b  2001  Ohio  1,7  NaN

**Spalten / Zeilen aufrufen**

In [65]:
# Spalten aufrufen
df1.head(2)
df1['state']  # dict style
df1.state  # Series style

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1,7

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [66]:
# Zeilen aufrufen
df1.loc[4]

state    Nevada
year       2001
pop         2.9
Name: 4, dtype: object

**Zuweisungen**

In [67]:
df2.dept = 15
df2

   year   state  pop  dept
a  2000    Ohio  1.5    15
b  2001    Ohio  1,7    15
c  2002    Ohio  3.6    15
d  2000  Nevada  2.4    15
e  2001  Nevada  2.9    15
f  2002  Nevada  3.1    15